Repository: MiguelAlcalaH/test-angular
Catalog: src/locale/messages.*.xlf
Languages: es

# HomeMenuTitle
source: Home
es: Inicio

# HealthMenuTitle
source: API Health
es: Salud API

# ProfileMenuTitle
source: Profile
es: Perfil

# SettingsMenuTitle
source: Settings
es: Ajustes

# LoginButton
source: Login
es: Iniciar Sesión

# LogoutButton
source: Logout
es: Cerrar Sesión

# HomeTitleMenuMobile
source: Home
es: Inicio

# HealthTitleMenuMobile
source: API Health
es: Salud API

# ProfileTitleMenuMobile
source: Profile
es: Perfil

# SettingsTitleMenuMobile
source: Settings
es: Ajustes

# HealthMainBodyMessage
source: API health status call ("{{ apiBackendUrl }}") is shown below:
es: A continuación se muestra el resultado de la llamada al monitor de salud del API ("{{ apiBackendUrl }}"):

# HomeFirstBodyMessage
source: Welcome to the Verisure Angular Quickstart v{{ version }} with MSAL v2 Authentication!!
es: Bienvenido a Verisure Angular Quickstart v{{ version }} con autenticación MSAL v2!!

# HomeSecondBodyMessage
source: The objective of this quickstart is to provide a scalable base template based on Angular framework.
es: El objetivo de este quickstart es proporcionar una base escalable en Angular Framework.

# HomeThirdBodyMessage
source: This sample demonstrates how to configure MSAL to login, logout, protect routes ("/api-health" and "/profile"), and acquire an access token for a protected resources such as the Microsoft Graph API and API Backend.
es: En este ejemplo se muestra cómo configurar el login/logout con MSAL, la protección de rutas ("/api-health" and "/profile") y el uso de roles para conceder acceso a una sección de administración ( "/settings") a usuarios con el rol de Administrador en Azure AD. También se muestra un ejemplo de adquisición de tokens de acceso a los recursos protegidos Microsoft Graph API y API Backend.

# HomeFourthBodyMessage
source: Please review the project's README.md file for details regarding the libraries and tools used in this Angular quickstart. You can also find guides related to best practices and troubleshooting in Angular development.
es: Por favor, revisa el README.md del proyecto para descubrir todos los detalles respecto a las librerías y herramientas utilizadas en este quickstart de Angular. También encontrarás guías relacionadas con buenas prácticas y resolución de problemas en el desarrollo de aplicaciones Angular.

# HomeFifthBodyMessage
source: This quickstart is experimental. If you have any comments or suggestions, please contact the Solution Architecture Team. Thank you.
es: Este quickstart es experimental. Si tienes algún comentario o sugerencia por favor contacta con el equipo de Arquitectura de Soluciones. Gracias.

# ProfileBodyMessage
source: This is a protected route, only accessible if you are correctly logged in as a Verisure Azure AD user.
es: Esta es una ruta protegida, solo accesible si estás correctamente autenticado en Verisure Azure AD

# ProfileFirstNameMessage
source: First Name:
es: Nombre:

# ProfileLastNameMessage
source: Last Name:
es: Apellidos:

# ProfileEmailMessage
source: Email:
es: Correo Electrónico:

# ProfileDetailsAPIMessage
source: User data obtained from Microsoft Graph API (https://graph.microsoft.com/v1.0/me).
es: Datos de usuario obtenidos desde Microsoft Graph API (https://graph.microsoft.com/v1.0/me)

# ProfilePKCEMessage
source: The authentication code flow with PKCE for SPA is documented at <a href="https://docs.microsoft.com/en-us/azure/active-directory/develop/tutorial-v2-javascript-auth-code" target="_blank" >Microsoft PKCE Code Flow</a >.
es: El flujo de autenticación con PKCE para aplicaicones de tipo Angular SPA está documentado en <a href="https://docs.microsoft.com/en-us/azure/active-directory/develop/tutorial-v2-javascript-auth-code" target="_blank" >Microsoft PKCE Code Flow</a >.

# SettingsAdminSectionMessage
source: Administration Section
es: Área de Administración

# SettingsBodyMessage
source: This is a protected route, only accessible if you are correctly logged in as a Verisure Azure AD user.
es: Esta es una ruta protegida, solo accesible si estás correctamente autenticado en Verisure Azure AD

# SettingsAdminOnlyMessage
source: This section is for administrator users only. If you see this area, it means that you have an administrator role for this application in Azure AD.
es: Esta sección es sólo para usuarios administradores. Si ve esta área, significa que tiene un rol de administrador para esta aplicación en Azure AD.
